LOAD_QUESTION = "Найдено сохранение, хотите продолжить?"
LOAD_CHOICE = "Enter - Продолжить | any key - Новая игра | q - Выйти"

START_QUESTION = "Тебя ждёт новое приключение!"
START_CHOICE = "any key - Новая игра | q - Выйти"

CHANGE_NAME_QUESTION = "Игрок с таким именем уже существует, продолжить?"
CHANGE_NAME_CHOICE = "Enter - да, продолжить | any key - Нет, сменить имя"

GET_NAME_QUESTION = "Введите никнейм персонажа: "
GET_NAME_CHOICE = "Enter - Продолжить | any key - Новая игра"

QUIT_QUESTION = "Вы точно хотите выйти из игры?"
QUIT_CHOICE = "Enter - Выйти | q - Продолжить"

DROP_QUESTION = "Выберете тип предмета для сброса"
DROP_CHOICE = "(e) свиток, (h) оружие, (j) еда, (k) эликсир, (q) назад"

STATS_HEADER = "Статистика прохождений (выйти - q)"
STATS_TABLE_HEADER_1 = (
    "  Никнейм   : Золото : Уровень    : Поверженные : Съеденной : Исп.  : Исп.    : Нанесенных : "
    "Промахов : Пройденных"
)
STATS_TABLE_HEADER_2 = (
    "            :        : подземелья : враги       : еды       : зелий : свитков : ударов     : "
    "         : клеток    "
)
STATS_UP = "листать вверх (w)"
STATS_DOWN = "листать вниз (s)"

START_LOGO = [
    "██████╗  ██████╗  ██████╗ ██╗   ██╗███████╗",
    "██╔══██╗██╔═══██╗██╔════╝ ██║   ██║██╔════╝",
    "██████╔╝██║   ██║██║  ███╗██║   ██║█████╗  ",
    "██╔══██╗██║   ██║██║   ██║██║   ██║██╔══╝  ",
    "██║  ██║╚██████╔╝╚██████╔╝╚██████╔╝███████╗",
    "╚═╝  ╚═╝ ╚═════╝  ╚═════╝  ╚═════╝ ╚══════╝",
    "",
    " ██╗  █████╗   █████╗   █████╗ ",
    "███║ ██╔══██╗ ██╔══██╗ ██╔══██╗",
    "╚██║ ╚██████║ ╚█████╔╝ ██║  ██║",
    " ██║  ╚═══██║ ██╔══██╗ ██║  ██║",
    " ██║  █████╔╝  █████╔╝  █████╔╝",
    " ╚═╝  ╚════╝   ╚════╝   ╚════╝ ",
]
GAME_OVER_LOGO = [
    " ██████╗  █████╗  ██████████╗ ███████╗",
    "██╔════╝ ██╔══██╗██╔══██╔══██║██╔════╝",
    "██║  ███╗███████║██║  ██║  ██║█████╗  ",
    "██║   ██║██╔══██║██║  ██║  ██║██╔══╝  ",
    "╚██████╔╝██║  ██║██║  ██║  ██║███████╗",
    " ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝  ╚═╝╚══════╝",
    "",
    " ██████╗ ██╗   ██╗███████╗██████╗ ",
    "██╔═══██╗██╚╗  ██║██╔════╝██╔══██╗",
    "██║   ██║╚██║ ██╔╝█████╗  ██████╔╝",
    "██║   ██║ ╚████╔╝ ██╔══╝  ██╔══██╗",
    "╚██████╔╝  ╚██╔╝  ███████╗██║  ██║",
    " ╚═════╝    ╚═╝   ╚══════╝╚═╝  ╚═╝",
]
WIN_LOGO = [
    "███████╗██╗██╗   ██╗ █████╗ ██╗       ██╗     ███████╗██╗   ██╗███████╗██╗     ",
    "██╔════╝██║████╗ ██║██╔══██╗██║       ██║     ██╔════╝██╚╗  ██║██╔════╝██║     ",
    "█████╗  ██║██╔██╗██║███████║██║       ██║     █████╗  ╚██║ ██╔╝█████╗  ██║     ",
    "██╔══╝  ██║██║╚████║██╔══██║██║       ██║     ██╔══╝   ╚████╔╝ ██╔══╝  ██║     ",
    "██║     ██║██║ ╚═██║██║  ██║███████╗  ███████╗███████╗  ╚██╔╝  ███████╗███████╗",
    "╚═╝     ╚═╝╚═╝   ╚═╝╚═╝  ╚═╝╚══════╝  ╚══════╝╚══════╝   ╚═╝   ╚══════╝╚══════╝",
    "",
    " ██████╗  ██████╗  ██████████╗ ██████╗ ██╗     ███████╗████████╗███████╗",
    "██╔═══██╗██╔═══██╗██╔══██╔══██║██╔══██╗██║     ██╔════╝╚══██╔══╝██╔════╝",
    "██║   ╚═╝██║   ██║██║  ██║  ██║██████╔╝██║     █████╗     ██║   █████╗  ",
    "██║   ██╗██║   ██║██║  ██║  ██║██╔═══╝ ██║     ██╔══╝     ██║   ██╔══╝  ",
    "╚██████╔╝╚██████╔╝██║  ██║  ██║██║     ███████╗███████╗   ██║   ███████╗",
    " ╚═════╝  ╚═════╝ ╚═╝  ╚═╝  ╚═╝╚═╝     ╚══════╝╚══════╝   ╚═╝   ╚══════╝",
]
CONTROLS_DICT = {
    "W": "шаг вверх",
    "A": "шаг влево",
    "S": "шаг вниз",
    "D": "шаг вправо",
    "H": "инвентарь с оружием",
    "J": "инвентарь с едой",
    "K": "инвентарь с зельями",
    "E": "инвентарь со свитками",
    "Q": "назад / выход из игры",
    "L": "выбросить предмет",
    "M": "звук вкл/вкл",
}
GAMEPLAY_LOGO = (
    "              ▄                ",
    "█▄▄▄▄ ████▄ ▄▀      ▄   ▄███▄  ",
    "█  ▄▀ █   █ █        █  █▀   ▀ ",
    "█▀▀▌  █   █ █ ▀▄  █   █ ██▄▄   ",
    "█  █  ▀████ █   █ █   █ █▄   ▄▀",
    "  █          ███  █▄ ▄█ ▀███▀  ",
    " █                 ▀▀▀         ",
    "▀                              ",
)
